In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
ser1 = Series(np.arange(3),index=['A','B','C'])

In [3]:
print(ser1)
ser1=ser1*2
print(ser1)

A    0
B    1
C    2
dtype: int32
A    0
B    2
C    4
dtype: int32

In [4]:
# returns the column value
ser1['A']

0

In [5]:
ser1[1]

2

In [6]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [7]:
ser1[ser1>3]

C    4
dtype: int32

In [8]:
ser1[ser1>3]=10

In [9]:
ser1

A     0
B     2
C    10
dtype: int32

In [10]:
dframe = DataFrame(np.arange(25).reshape(5,5),index=['Usa','china','india','japan','Mexico'],columns =['A','B','C','D','E'])

In [11]:
dframe

         A   B   C   D   E
Usa      0   1   2   3   4
china    5   6   7   8   9
india   10  11  12  13  14
japan   15  16  17  18  19
Mexico  20  21  22  23  24

In [12]:
dframe.A

Usa        0
china      5
india     10
japan     15
Mexico    20
Name: A, dtype: int32

In [42]:
dframe.A[['Usa','china']]

Usa      0
china    5
Name: A, dtype: int32

In [22]:
dframe[['A','B']]['Usa']

KeyError: 'Usa'

In [15]:
t = Series([1,2,3,4,5],index=['A','B','C','D','E'])

In [16]:
t

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [18]:
t[
    ['A','B']
]

A    1
B    2
dtype: int64

In [20]:
t.drop('A')

B    2
C    3
D    4
E    5
dtype: int64

In [23]:
dframe

         A   B   C   D   E
Usa      0   1   2   3   4
china    5   6   7   8   9
india   10  11  12  13  14
japan   15  16  17  18  19
Mexico  20  21  22  23  24

In [24]:
dframe['A']

Usa        0
china      5
india     10
japan     15
Mexico    20
Name: A, dtype: int32

In [25]:
dframe.A

Usa        0
china      5
india     10
japan     15
Mexico    20
Name: A, dtype: int32

In [26]:
dframe[['A','B']]

         A   B
Usa      0   1
china    5   6
india   10  11
japan   15  16
Mexico  20  21

In [41]:
dframe[dframe['C']>8]

         A   B   C   D   E
india   10  11  12  13  14
japan   15  16  17  18  19
Mexico  20  21  22  23  24

In [45]:
dframe['C']>8

Usa       False
china     False
india      True
japan      True
Mexico     True
Name: C, dtype: bool

In [46]:
dframe>10

            A      B      C      D      E
Usa     False  False  False  False  False
china   False  False  False  False  False
india   False   True   True   True   True
japan    True   True   True   True   True
Mexico   True   True   True   True   True

In [47]:
dframe*2

         A   B   C   D   E
Usa      0   2   4   6   8
china   10  12  14  16  18
india   20  22  24  26  28
japan   30  32  34  36  38
Mexico  40  42  44  46  48

In [49]:
dframe.iloc('Usa')

ValueError: No axis named Usa for object type DataFrame

In [50]:
dframe['A']

Usa        0
china      5
india     10
japan     15
Mexico    20
Name: A, dtype: int32

In [51]:
dframe.loc['Usa']

A    0
B    1
C    2
D    3
E    4
Name: Usa, dtype: int32

In [52]:
# loc means retrieving row by row name
dframe.loc['china']

A    5
B    6
C    7
D    8
E    9
Name: china, dtype: int32

In [53]:
dframe.loc['china']['A']

5

In [55]:
# iloc means integer loc i.e retrieving row by integer
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: china, dtype: int32

In [1]:
list('abc')

['a', 'b', 'c']

In [1]:
np.sign(dframe)

NameError: name 'np' is not defined